{
  "booklist": [
    [],
    [],
    {
      "kind": "books#volume",
      "id": "274fCwAAQBAJ",
      "etag": "rH1TfWMm1iQ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/274fCwAAQBAJ",
      "volumeInfo": {
        "title": "Learning React Native",
        "subtitle": "Building Native Mobile Apps with JavaScript",
        "authors": [
          "Bonnie Eisenman"
        ],
        "publisher": "\"O'Reilly Media, Inc.\"",
        "publishedDate": "2015-12-03",
        "description": "Get a practical introduction to React Native, the JavaScript framework for writing and deploying fully featured mobile apps that look and feel native. With this hands-on guide, you’ll learn how to build applications that target iOS, Android, and other mobile platforms instead of browsers. You’ll also discover how to access platform features such as the camera, user location, and local storage. With code examples and step-by-step instructions, author Bonnie Eisenman shows web developers and frontend engineers how to build and style interfaces, use mobile components, and debug and deploy apps. Along the way, you’ll build several increasingly sophisticated sample apps with React Native before putting everything together at the end. Learn how React Native provides an interface to native UI components Examine how the framework uses native components analogous to HTML elements Create and style your own React Native components and applications Install modules for APIs and features not supported by the framework Get tools for debugging your code, and for handling issues outside of JavaScript Put it all together with the Zebreto effective-memorization flashcard app Deploy apps to the iOS App Store and Google’s Play Store",
        "industryIdentifiers": [
          {
            "type": "ISBN_13",
            "identifier": "9781491929070"
          },
          {
            "type": "ISBN_10",
            "identifier": "1491929073"
          }
        ],
        "readingModes": {
          "text": false,
          "image": true
        },
        "pageCount": 271,
        "printType": "BOOK",
        "categories": [
          "COMPUTERS"
        ],
        "maturityRating": "NOT_MATURE",
        "allowAnonLogging": false,
        "contentVersion": "preview-1.0.0",
        "panelizationSummary": {
          "containsEpubBubbles": false,
          "containsImageBubbles": false
        },
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=274fCwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=274fCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
        },
        "language": "en",
        "previewLink": "http://books.google.com/books?id=274fCwAAQBAJ&pg=PA12&dq=react&hl=&cd=2&source=gbs_api",
        "infoLink": "http://books.google.com/books?id=274fCwAAQBAJ&dq=react&hl=&source=gbs_api",
        "canonicalVolumeLink": "https://books.google.com/books/about/Learning_React_Native.html?hl=&id=274fCwAAQBAJ"
      },
      "saleInfo": {
        "country": "KE",
        "saleability": "NOT_FOR_SALE",
        "isEbook": false
      },
      "accessInfo": {
        "country": "KE",
        "viewability": "PARTIAL",
        "embeddable": true,
        "publicDomain": false,
        "textToSpeechPermission": "ALLOWED",
        "epub": {
          "isAvailable": false
        },
        "pdf": {
          "isAvailable": true
        },
        "webReaderLink": "http://play.google.com/books/reader?id=274fCwAAQBAJ&hl=&source=gbs_api",
        "accessViewStatus": "SAMPLE",
        "quoteSharingAllowed": false
      },
      "searchInfo": {
        "textSnippet": "In <b>React</b> Native, just as in <b>React</b>, we write our views using JSX, combining markup and the JavaScript that controls it into a single file. JSX met with strong <b>reactions</b> when <b>React</b> first debuted. For many web developers, the separation of&nbsp;..."
      }
    },
    {
      "kind": "books#volume",
      "id": "uUMQEAAAQBAJ",
      "etag": "WtgYw+5NgSE",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/uUMQEAAAQBAJ",
      "volumeInfo": {
        "title": "Full-Stack React, TypeScript, and Node",
        "subtitle": "Build cloud-ready web applications using React 17 with Hooks and GraphQL",
        "authors": [
          "David Choi"
        ],
        "publisher": "Packt Publishing Ltd",
        "publishedDate": "2020-12-18",
        "description": "Discover the current landscape of full-stack development and how to leverage modern web technologies for building production-ready React.js applications to deploy on AWS Key FeaturesUnderstand the architecture of React and single-page applicationsBuild a modern Web API for your SPA using Node.js, Express, and GraphQLGain a clear and practical understanding of how to build a complete full-stack applicationBook Description React sets the standard for building high-performance client-side web apps. Node.js is a scalable application server that is used in thousands of websites, while GraphQL is becoming the standard way for large websites to provide data and services to their users. Together, these technologies, when reinforced with the capabilities of TypeScript, provide a cutting-edge stack for complete web application development. This book takes a hands-on approach to implementing modern web technologies and the associated methodologies for building full-stack apps. You’ll begin by gaining a strong understanding of TypeScript and how to use it to build high-quality web apps. The chapters that follow delve into client-side development with React using the new Hooks API and Redux. Next, you’ll get to grips with server-side development with Express, including authentication with Redis-based sessions and accessing databases with TypeORM. The book will then show you how to use Apollo GraphQL to build web services for your full-stack app. Later, you’ll learn how to build GraphQL schemas and integrate them with React using Hooks. Finally, you’ll focus on how to deploy your application onto an NGINX server using the AWS cloud. By the end of this book, you’ll be able to build and deploy complete high-performance web applications using React, Node, and GraphQL. What you will learnDiscover TypeScript’s most important features and how they can be used to improve code quality and maintainabilityUnderstand what React Hooks are and how to build React apps using themImplement state management for your React app using ReduxSet up an Express project with TypeScript and GraphQL from scratchBuild a fully functional online forum app using React and GraphQLAdd authentication to your web app using RedisSave and retrieve data from a Postgres database using TypeORMConfigure NGINX on the AWS cloud to deploy and serve your appsWho this book is for The book is for web developers who want to go beyond front-end web development and enter the world of full-stack web development by learning about modern web technologies and how they come together. A good understanding of JavaScript programming is required before getting started with this web development book.",
        "industryIdentifiers": [
          {
            "type": "ISBN_13",
            "identifier": "9781839214691"
          },
          {
            "type": "ISBN_10",
            "identifier": "1839214694"
          }
        ],
        "readingModes": {
          "text": true,
          "image": true
        },
        "pageCount": 648,
        "printType": "BOOK",
        "categories": [
          "Computers"
        ],
        "maturityRating": "NOT_MATURE",
        "allowAnonLogging": true,
        "contentVersion": "1.1.1.0.preview.3",
        "panelizationSummary": {
          "containsEpubBubbles": false,
          "containsImageBubbles": false
        },
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=uUMQEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=uUMQEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
        },
        "language": "en",
        "previewLink": "http://books.google.com/books?id=uUMQEAAAQBAJ&pg=PA212&dq=react&hl=&cd=3&source=gbs_api",
        "infoLink": "http://books.google.com/books?id=uUMQEAAAQBAJ&dq=react&hl=&source=gbs_api",
        "canonicalVolumeLink": "https://books.google.com/books/about/Full_Stack_React_TypeScript_and_Node.html?hl=&id=uUMQEAAAQBAJ"
      },
      "saleInfo": {
        "country": "KE",
        "saleability": "NOT_FOR_SALE",
        "isEbook": false
      },
      "accessInfo": {
        "country": "KE",
        "viewability": "PARTIAL",
        "embeddable": true,
        "publicDomain": false,
        "textToSpeechPermission": "ALLOWED",
        "epub": {
          "isAvailable": true
        },
        "pdf": {
          "isAvailable": true
        },
        "webReaderLink": "http://play.google.com/books/reader?id=uUMQEAAAQBAJ&hl=&source=gbs_api",
        "accessViewStatus": "SAMPLE",
        "quoteSharingAllowed": false
      },
      "searchInfo": {
        "textSnippet": "Build cloud-ready web applications using <b>React</b> 17 with Hooks and GraphQL David Choi. The GitHub repository is at https://github.com/PacktPublishing/Full- Stack-<b>React</b>-TypeScript-and-Node. Use the code in the Chap7 folder."
      }
    },
    {
      "kind": "books#volume",
      "id": "jUvZDQAAQBAJ",
      "etag": "bl+No/bnwRU",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/jUvZDQAAQBAJ",
      "volumeInfo": {
        "title": "React: Building Modern Web Applications",
        "authors": [
          "Jonathan Hayward",
          "Artemij Fedosejev",
          "Narayan Prusty",
          "Adam Horton",
          "Ryan Vice",
          "Ethan Holmes",
          "Tom Bray"
        ],
        "publisher": "Packt Publishing Ltd",
        "publishedDate": "2016-06-10",
        "description": "Master the art of building dynamic, modern web applications with React About This Book Learn the hot new frontend web framework from Facebook – ReactJS, an easy way of developing the V in MVC and a better approach to software engineering in JavaScript A fast-paced guide to designing and building scalable and maintainable web apps with React.js Learn all the new ES6 features and be among the most prominent JavaScript developers who can write efficient JS programs as per the latest standards Master the art of building modern web applications using React Learn to build modern native iOS and Android applications using JavaScript and the incredible power of React Who This Book Is For This course is for web developers that want to unlock high performance dynamism in the applications that they create. If you want a comprehensive journey into one of the most important JavaScript frameworks around today, dive into this course. What You Will Learn Take control of the front end with reactive JavaScript programming Discover what ReactJS offers your development - before mastering it Create React elements with properties and children Use JSX to speed up your React development process Test your React components with the Jest test framework Learn the latest syntax of ES6 Execute ES6 in a non-supported ES6 environment Learn the principles of object-oriented programming Create a complete single-page application Use an application design plan to write smarter, more meaningful code Learn how to use animations to give extra style to your application Get to grips with the React Native environment Write your own custom native UI components Integrate native modules in Objective-C and Java that interact with JavaScript In Detail ReactJS has helped to transform the web as we know it. Designed by Facebook to help developers build rapid, responsive UI that can deal with data-intensive usage, it's an essential component in any web developer's skillset. This ReactJS course, in five connected modules, provides you with a fast, engaging and practical route into ReactJS—so you can build powerful, elegant, and modern web applications. Beginning with the Reactive Programming with JavaScript module, you will learn how to take advantage of a reactive and functional programming paradigm to rethink how you approach your JavaScript code. It's built to help you understand the concepts, relevant and applicable for any frontend developer. You'll then dive a little deeper into ReactJS. The second module gives you a rapid look through the fundamentals of ReactJS, showing you how to build a basic application and demonstrating how to implement the Flux architecture. In the third module you will get to grips with ES6—this will make you a more fluent JavaScript developer, giving you control over ReactJS. You can put your old JavaScript hacks aside and instead explore how to create ES6 custom iterators. In the final two modules you'll learn how to fully master ReactJS, exploring its wider ecosystem of tools that have helped to make it one of the most important tools in web development today. Ending with insights and guidance on React Native, the tool built for today's demand for native, intuitive user experiences and interfaces, with this course you can be confident in building dynamic and modern apps with React. Style and approach Consisting of five separate modules, journey from the fundamentals of reactive programming to the exciting possibilities of React Native. Each module builds on each other, helping you to incrementally develop your skills and knowledge.",
        "industryIdentifiers": [
          {
            "type": "ISBN_13",
            "identifier": "9781786462848"
          },
          {
            "type": "ISBN_10",
            "identifier": "1786462842"
          }
        ],
        "readingModes": {
          "text": true,
          "image": false
        },
        "pageCount": 910,
        "printType": "BOOK",
        "categories": [
          "Computers"
        ],
        "averageRating": 3,
        "ratingsCount": 1,
        "maturityRating": "NOT_MATURE",
        "allowAnonLogging": true,
        "contentVersion": "1.1.3.0.preview.2",
        "panelizationSummary": {
          "containsEpubBubbles": false,
          "containsImageBubbles": false
        },
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=jUvZDQAAQBAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=jUvZDQAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
        },
        "language": "en",
        "previewLink": "http://books.google.com/books?id=jUvZDQAAQBAJ&dq=react&hl=&cd=1&source=gbs_api",
        "infoLink": "http://books.google.com/books?id=jUvZDQAAQBAJ&dq=react&hl=&source=gbs_api",
        "canonicalVolumeLink": "https://books.google.com/books/about/React_Building_Modern_Web_Applications.html?hl=&id=jUvZDQAAQBAJ"
      },
      "saleInfo": {
        "country": "KE",
        "saleability": "NOT_FOR_SALE",
        "isEbook": false
      },
      "accessInfo": {
        "country": "KE",
        "viewability": "NO_PAGES",
        "embeddable": false,
        "publicDomain": false,
        "textToSpeechPermission": "ALLOWED",
        "epub": {
          "isAvailable": true
        },
        "pdf": {
          "isAvailable": true
        },
        "webReaderLink": "http://play.google.com/books/reader?id=jUvZDQAAQBAJ&hl=&source=gbs_api",
        "accessViewStatus": "NONE",
        "quoteSharingAllowed": false
      },
      "searchInfo": {
        "textSnippet": "Master the art of building dynamic, modern web applications with React About This Book Learn the hot new frontend web framework from Facebook – ReactJS, an easy way of developing the V in MVC and a better approach to software engineering ..."
      }
    }
  ]
}